{
  "milestones":[
  {
    "year":"1947-1972",
    "title":"Founding and early administration",
    "description":"In 1947, Silvio Brovedani, an enterprising mechanic with extraordinary talents, opens a small machine shop in the Pordenone area.  A great economic boom occurs during those years, and the small company soon calls upon local producers in an area that is establishing itself as one of the most important districts for the Italian metalworking industry, with major firms such as the Zanussi group.  Also, the Maniago area becomes known for its screws for scissors and its pins for the handles of kitchen and pocket knives.",
    "nation":"San Vito"
  },
  {
    "year":"1972-1974",
    "title":"Relationship with Zanussi",
    "description":"In 1972, the company is taken over by Benito Zollia’s company who involves Felice Macuz. They set themselves the goal of giving it new vitality by building on the experience acquired during the previous decades of activity. The Savio bearing is 1973’s main product, making the thread run on the bobbin winders at a speed of 14,000 rpm. In 1974, there is an increase in hinge production for Zanussi washing machine doors, a new hinge concept in stamped sheet metal developed by Brovedani.",
    "nation":"San Vito"
  },
  {
    "year":"1974-1977",
    "title":"New Brovedani applications in the defence sector and new clients",
    "description":"In 1975, Brovedani becomes leader in the production of components for tubular electrical resistances. The factors which contributed to our success area include: unusual technologies such as peening, innovative ideas and dedicated production lines. In 1976, the company moves from Pordenone to its new headquarters in San Vito al Tagliamento. Brovedani purchases new production machines and acquires MZM, a company specializing in heat treatments. Its clients include Officine Meccaniche Goriziane in Gorizia, IRET in Trieste and Maddalena in Udine. In 1977, Brovedani enters into new applications for the defence sector by supplying the rocket flame-extinguishing nozzle to SNIA, according to the Military Standard regulations.",
    "nation":"San Vito"
  },
  {
    "year":"1978-1979",
    "title":"Entry into the automotive industry",
    "description":"In 1978, Brovedani starts production of automotive components, such as the steering box for the Yugoslavian group Soko, which manufactures under licence to TRW. The new technical structure works and grows with the development of a cold formed blank and the use of diversified technologies, from chip removal to roll forming, and from induction hardening to non-destructive tests. Piaggio welcomes the company amongst its suppliers in 1979 and recognizes its excellent production standards.",
    "nation":"San Vito"
  },
  {
    "year":"1980-1985",
    "title":"Micro-mechanics with IBM and Olivetti",
    "description":"In 1980, a co-operation is formed, marking what becomes the “IBM decade”. Product co-design (hard-disk components), choice of production technologies, design and construction of specific production machines and computerized control systems are just some of the aspects that will become an integral part of Brovedani’s know-how. Micro-mechanics takes its first steps in 1981. Brovedani co-operates with MiniGears, leader in the production of mini-gears. In 1982, Brovedani co-designs an innovative photocopying machine with Olivetti. The San Vito plant supplies sophisticated components with electroless nickel plating. In 1983, Brovedani undertakes the challenge of the design and industrialization of a finished product: the hypodermic pressure injector with no-needle. In 1984, after becoming a supplier of IBM in Great Britain, the hard disk memory sector accounts for almost half of turnover. Brovedani needs to expand in order to meet demand and adopt new process technologies such as: electroless nickel plating, aluminium chromium-plating and electrochemical de-burring. In 1985, Brovedani’s expertise in cold blanking is highly appreciated. Important supplies are made to Verdichter, compressor manufacturer of the Electrolux-Zanussi Group.",
    "nation":"San Vito"
  },
  {
    "year":"1986-1990",
    "title":"Automotive and micro-mechanical components for IBM",
    "description":"In 1986, Brovedani begins direct co-operation with components manufacturers in the automotive Sector. In 1987, it forms a relationship with the German company, Buderus: the aim is to develop a sophisticated robot at a limited cost. In the same year it purchases an entire machining department from Landis and Gyr in outsourcing. In 1988, Brovedani starts supplying components to the IBM plant in Mainz, Germany. For two consecutive years, the company is awarded the IMB’s “Best Supplier” certificate. In the San Vito plant, departments are created for external grinding and threading, and the dimensional control process is automated. From 1989 onwards, the automotive sector plays a growing role in Brovedani’s business. This requires new investments in order to create specific automated lines. The production line for starter motor shafts, which includes lathes, rolling machines, induction hardening and grinding units, is one example. The role of the operator is limited to controls and servicing. In 1990, Brovedani builds a clean room to meet the requirements for absolute cleanliness of components for IBM computers. Brovedani installs the most sophisticated washing machines and the most advanced systems for checking for the presence of particles on the parts after the washing process. Brovedani designs these systems in co-operation with specialized companies.",
    "nation":"San Vito"
  },
  {
    "year":"1991-1994",
    "title":"New process technologies, ISO 9002 certification",
    "description":"In 1991, Brovedani establishes business relationships with European leaders in the manufacture of gasoline injection systems. The technologies used include laser welding, localized hard chrome deposits and high-vacuum annealing. In 1992, a special cold forging system is developed that adopts the most advanced technologies in the field of materials, treatments and tool coating. In 1993 Brovedani obtains ISO 9002 certification. In 1994, the growth of the company’s technical structure is marked by the development of the latest generation of transfer lines with automatic pallet loading and unloading, post-process dimensional control, function display with fault indication, programmed tool change and units with controlled axes. All this is controlled by specific in-house programmed PLCs.",
    "nation":"San Vito"
  },
  {
    "year":"1995-1998",
    "title":"Production decentralization and constant technological development",
    "description":"In 1995, the project for decentralization of production is implemented, bringing added value to the Customer Service concept. This is how the Bari and Pisa units came into being, in order to supply maximum service by transferring production near to the customer’s production plant. From 1996 onwards, Brovedani is increasingly involved with its customers in the development of new motorcycle engines, new gasoline injection systems and the redesign of braking systems.",
    "nation":"Bari"
  },
  {
    "year":"1998-2000",
    "title":"Leaders in Diesel Common Rail systems",
    "description":"In 1998, Brovedani obtains the QS 9000 certification for the San Vito plant. In the same year it starts production of the first Common Rail module for Bosch Diesel systems. With the introduction of new technologies, the second integrated line for starter shafts doubles its capacity for induction hardening, cold roll forming, centreless-grinding, tempering, and rust protection. In 1999, production of the Bosch Diesel Common Rail components reaches volume levels much higher than originally planned. The Bari plant is moved near Bosch Sistemi Frenanti, making it possible to start up production of rear pistons for calipers on the client’s “doorstep”. Also production for Magneti Marelli is transferred from San Vito to Bari, again on the client’s “doorstep”. In 2000 Brovedani obtains QS 9000 certification for the Bari and Pisa plants. At the same time it launches series production of Common Rail Kits for the various world players in the market. During the year 2000 the stamping and blanking plant becomes an autonomous production site, located not far from the headquarters in San Vito. This plant is dedicated to stamping from wire, sheet-metal deep-drawing, cold coining, braze-welding and surface treatment processes.",
    "nation":"San Vito"
  },
  {
    "year":"2001-2002",
    "title":"SAP, Process Management and new Technologies",
    "description":"In 2001, Brovedani is involved in the first on-line bids. The market growth generated by the success of Diesel cars in  Europe, consolidates Brovedani as a supplier of components for injectors and high pressure pumps. New technologies are introduced, such as super-finishes for flat and cylindrical surfaces and digital imaging. Production of precision components for the Common Rail high-pressure injection pump, is moved from San Vito to Bari. The company outsourcing policy is strengthened with the implementation of the Eaton project at the Pisa plant. Finally, production capacities increase when the Depoisier-Gervex company (Marnaz-France) becomes part of the Group.  The firm is located in a region that is internationally known as “machine screw valley”.",
    "nation":"San Vito"
  },
  {
    "year":"2003",
    "title":"ISO TS 16949 Global certification",
    "description":"To better handle Brovedani’s powerful growth, the Group moves its Pisa factory to a larger, better equipped facility in Guasticce-Livorno. That same year, all Brovedani factories are certified as complying with ISO TS 16949 standards. Production in the Bari facility is broadened to include pistons for brake calipers, and an important agreement is stipulated with Bosch for the manufacture of shafts for motor vehicle starting motors.",
    "nation":"Bari"
  },
  {
    "year":"2004",
    "title":"New partnerships, new markets",
    "description":"At San Vito al Tagliamento, a new production site is opened which is mainly devoted to the production of shafts. Brovedani continues growing thanks to the success of the Common Rail system, whose components are now exported to Japan and the United States. And thanks to an important agreement, Delphi begins working with Brovedani in the sectors of steering systems and diesel injection.  The agreement provides for the development of ultra high-precision components and requires the Group to make new, significant Investments.",
    "nation":"San Vito"
  },
  {
    "year":"2005",
    "title":"A factory in the Eastern Europe",
    "description":"Brovedani expands its product mix thanks to a supply agreement with Sanden, a leading company in the sector of automotive compressors. A new factory opens in Galanta (the Slovak Republic) that meets the growing demand for locally supplied products in Eastern Europe.",
    "nation":"Galanta"
  },
  {
    "year":"2006",
    "title":"Keymec: a specialized training project",
    "description":"The Brovedani factory in Galanta also obtains ISO TS 16949 certification. Components for the Siemens diesel injection system begin to be sold on the American market. And with the decisive contribution of Brovedani, the KEYMEC Center of Innovation, Research and Training in mechanics is opened. Its purpose is to train researchers and technicians who specialize in mechanics, in innovative processes, and in the prototyping of new products.",
    "nation":"San Vito - Galanta"
  },
  {
    "year":"2009",
    "title":"A factory in the North America",
    "description":"Brovedani Group and Reme (a Mexican company founded in 1965 with headquarters and production site in Queretaro), sign a joint venture agreement founding the Brovedani Reme Mexico. The new company responds to the increasing demand for reliable partners in the field of precision mechanics for the Mexican market and, more generally, for the NAFTA market.",
    "nation":"Queretaro"
  },
  {
    "year":"2011",
    "title":"Brovedani Slovakia plant expansion",
    "description":"The expansion operations started on 2004 and on 2008 was built the first new production area. The end of construction activities is planned for 2011-2012. The final configuration of the Slovak plant will have a covered area of 8.500 sq.m., in detail 300 sq.m. of offices and 8.000 sq.m. dedicated of production area, on a total surface of 19.200 s.q.m.",
    "nation":"Galanta"
  },
  {
    "year":"2011-2012",
    "title":"Brovedani Reme Mexico new building",
    "description":"In line with the expansion strategy of Brovedani Reme Mexico in the american market on 2011 has started the new building construction which will be operative within the beginning of 2012. The final configuration will have a total surface of 32.000 sq.m., in detail 10.400 sq.m. of covered area, 8.500 sq.m. of production & warehouse area.",
    "nation":"Queretaro"
  },
  {
    "year":"2013-2015",
    "title":"Leader in gasoline Direct Injection components",
    "description":"",
    "nation":""
  },
  {
    "year":"2017",
    "title":"KEY MILESTONES GOING FORWARD",
    "description":"Leveraging trends in automotive industry. Expansion of product portfolio. NAFTA market consolidation",
    "nation":""
  }
]
}
